app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" ORDER BY publish_at desc
---
  def index
    @articles = Article.order('publish_at desc')

SELECT  "articles".* FROM "articles" WHERE "articles"."slug" = $1 LIMIT $2  [["slug", "useless-stuff-on-producthunt"], ["LIMIT", 1]]
---
  def show
    @article = Article.find_by(slug: params[:id])