app/controllers/projects_controller.rb

  def index
    @projects = Project.order('year ASC, id ASC')
---
SELECT "projects".* FROM "projects" ORDER BY year ASC, id ASC

  def show
    @project = Project.find_by(slug: params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."slug" = $1 LIMIT $2  [["slug", "1-reallydumbstuff"], ["LIMIT", 1]]